7767517
77 94
Input                    inputs                   0 1 inputs
Split                    splitncnn_input0         1 2 inputs inputs_splitncnn_0 inputs_splitncnn_1
MFDNet_haar              haar_1                   1 1 inputs_splitncnn_1 /downsample_blocks/downsample_blocks.0/Concat_output_0
MFDNet_haar              haar_2                   1 1 /downsample_blocks/downsample_blocks.0/Concat_output_0 /downsample_blocks/downsample_blocks.1/Concat_output_0
Split                    splitncnn_15             1 4 /downsample_blocks/downsample_blocks.1/Concat_output_0 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_0 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_1 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_2 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_3
Convolution              /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.0/Conv 1 1 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_3 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.1/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.2/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.0/mfdb/mfdb.0/Add 2 1 /M_block/M_block.0/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_2 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0
Split                    splitncnn_16             1 2 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.0/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0_splitncnn_1 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.1/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.2/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.0/mfdb/mfdb.1/Add 2 1 /M_block/M_block.0/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0
Split                    splitncnn_17             1 2 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.0/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0_splitncnn_1 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.1/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.2/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.0/mfdb/mfdb.2/Add 2 1 /M_block/M_block.0/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 /M_block/M_block.0/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0
Split                    splitncnn_18             1 2 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0_splitncnn_1
MFDNet_haar              haar_3                   1 1 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0_splitncnn_1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0
Convolution              /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.1/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 0=16 1=3 4=1 5=1 6=9216 9=1
Convolution              /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.3/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 0=16 1=3 4=1 5=1 6=2304 9=1
Convolution              /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.5/Conv 1 1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 0=16 1=3 4=1 5=1 6=2304 9=4
Interp                   /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.7/Resize 1 1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00
BinaryOp                 /M_block/M_block.0/mfdb/mfdb.3/Mul 2 1 /M_block/M_block.0/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 /M_block/M_block.0/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.0/mfdb/mfdb.3/Mul_output_0 0=2
BinaryOp                 /M_block/M_block.0/Add   2 1 /M_block/M_block.0/mfdb/mfdb.3/Mul_output_0 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_1 /M_block/M_block.0/Add_output_0
Split                    splitncnn_26             1 3 /M_block/M_block.0/Add_output_0 /M_block/M_block.0/Add_output_0_splitncnn_0 /M_block/M_block.0/Add_output_0_splitncnn_1 /M_block/M_block.0/Add_output_0_splitncnn_2
Convolution              /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.0/Conv 1 1 /M_block/M_block.0/Add_output_0_splitncnn_2 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.1/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.2/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.1/mfdb/mfdb.0/Add 2 1 /M_block/M_block.1/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 /M_block/M_block.0/Add_output_0_splitncnn_1 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0
Split                    splitncnn_27             1 2 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.0/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0_splitncnn_1 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.1/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.2/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.1/mfdb/mfdb.1/Add 2 1 /M_block/M_block.1/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0
Split                    splitncnn_28             1 2 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.0/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0_splitncnn_1 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.1/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.2/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.1/mfdb/mfdb.2/Add 2 1 /M_block/M_block.1/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 /M_block/M_block.1/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0
Split                    splitncnn_29             1 2 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0_splitncnn_1
MFDNet_haar              haar_4                   1 1 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0_splitncnn_1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0
Convolution              /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.1/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 0=16 1=3 4=1 5=1 6=9216 9=1
Convolution              /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.3/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 0=16 1=3 4=1 5=1 6=2304 9=1
Convolution              /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.5/Conv 1 1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 0=16 1=3 4=1 5=1 6=2304 9=4
Interp                   /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.7/Resize 1 1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00
BinaryOp                 /M_block/M_block.1/mfdb/mfdb.3/Mul 2 1 /M_block/M_block.1/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 /M_block/M_block.1/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.1/mfdb/mfdb.3/Mul_output_0 0=2
BinaryOp                 /M_block/M_block.1/Add   2 1 /M_block/M_block.1/mfdb/mfdb.3/Mul_output_0 /M_block/M_block.0/Add_output_0_splitncnn_0 /M_block/M_block.1/Add_output_0
Split                    splitncnn_37             1 3 /M_block/M_block.1/Add_output_0 /M_block/M_block.1/Add_output_0_splitncnn_0 /M_block/M_block.1/Add_output_0_splitncnn_1 /M_block/M_block.1/Add_output_0_splitncnn_2
Convolution              /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.0/Conv 1 1 /M_block/M_block.1/Add_output_0_splitncnn_2 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.1/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.0/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.2/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.1/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.2/mfdb/mfdb.0/Add 2 1 /M_block/M_block.2/mfdb/mfdb.0/repconv/repconv.2/Conv_output_0 /M_block/M_block.1/Add_output_0_splitncnn_1 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0
Split                    splitncnn_38             1 2 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.0/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0_splitncnn_1 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.1/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.0/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.2/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.1/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.2/mfdb/mfdb.1/Add 2 1 /M_block/M_block.2/mfdb/mfdb.1/repconv/repconv.2/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.0/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0
Split                    splitncnn_39             1 2 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0_splitncnn_1
Convolution              /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.0/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0_splitncnn_1 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 0=32 1=1 5=1 6=512
Convolution              /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.1/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.0/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 0=32 1=3 4=1 5=1 6=9216
Convolution              /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.2/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.1/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 0=16 1=1 5=1 6=512
BinaryOp                 /M_block/M_block.2/mfdb/mfdb.2/Add 2 1 /M_block/M_block.2/mfdb/mfdb.2/repconv/repconv.2/Conv_output_0 /M_block/M_block.2/mfdb/mfdb.1/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0
Split                    splitncnn_40             1 2 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0_splitncnn_1
MFDNet_haar              haar_5                   1 1 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0_splitncnn_1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0
Convolution              /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.1/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.0/Concat_output_0 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 0=16 1=3 4=1 5=1 6=9216 9=1
Convolution              /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.3/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.2/Relu_output_0 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 0=16 1=3 4=1 5=1 6=2304 9=1
Convolution              /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.5/Conv 1 1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.4/Relu_output_0 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 0=16 1=3 4=1 5=1 6=2304 9=4
Interp                   /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.7/Resize 1 1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.6/Sigmoid_output_0 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 0=2 1=2.000000e+00 2=2.000000e+00
BinaryOp                 /M_block/M_block.2/mfdb/mfdb.3/Mul 2 1 /M_block/M_block.2/mfdb/mfdb.3/mfa/mfa.7/Resize_output_0 /M_block/M_block.2/mfdb/mfdb.2/Add_output_0_splitncnn_0 /M_block/M_block.2/mfdb/mfdb.3/Mul_output_0 0=2
BinaryOp                 /M_block/M_block.2/Add   2 1 /M_block/M_block.2/mfdb/mfdb.3/Mul_output_0 /M_block/M_block.1/Add_output_0_splitncnn_0 /M_block/M_block.2/Add_output_0
BinaryOp                 /Add                     2 1 /M_block/M_block.2/Add_output_0 /downsample_blocks/downsample_blocks.1/Concat_output_0_splitncnn_0 /Add_output_0
Convolution              /recon/recon.0/Conv      1 1 /Add_output_0 /recon/recon.0/Conv_output_0 0=16 1=3 4=1 5=1 6=2304
PixelShuffle             /recon/recon.1/DepthToSpace 1 1 /recon/recon.0/Conv_output_0 /recon/recon.1/DepthToSpace_output_0 0=4
BinaryOp                 /Add_1                   2 1 /recon/recon.1/DepthToSpace_output_0 inputs_splitncnn_0 outputs
